{
    "questions": [
        {
            "title": "1️⃣ Porquê que devo utilizar um Gestor de passwords?",
            "description": [
                "O Gestor de passwords é uma ferramenta que permite a gestão de relações entre idosos e cuidadores. Através do PM é possível estabelecer relações entre idosos e cuidadores, bem como visualizar as relações já estabelecidas."
            ],
            "video": ""
        },
        {
            "title": "2️⃣ Quantas relações posso ter estabelecidas?",
            "description": [
                "Cada idoso pode estabelecer relações com, no máximo, 2 cuidadores. Por sua vez, um cuidador pode estabelecer uma relação com, no máximo, 4 idosos."
            ],
            "video": ""
        }
    ],
    "suggestions": [
        {
            "title": "✨ Nunca partilhe as suas credenciais de acesso por outro meio que não seja este Gestor de passwords. ✨",
            "description": [],
            "video": ""
        },
        {
            "title": "✨ Se não utilizar uma password gerada pelo Gestor de passwords, certifique-se que a password que está a utilizar é forte o suficiente através do emoji. ✨",
            "description": [],
            "video": ""
        }
    ],
    "stepByStep": [
        {
            "title": "- Como é que crio uma conta nova?",
            "description": [
                "1️⃣: Abra a aplicação e irá aparecer o formulário de login, e clique no botão 'Criar Conta'.",
                "2️⃣: Preencha o formulário com os dados necessários, nomeadamente o nome, o seu email, número de telefone e a sua password principal.",
                "3️⃣: Após todos os dados preenchidos, clique no botão 'Criar Conta'.",
                "4️⃣: Caso os dados estejam bem preenchidos, nomeadamente o email, será redirecionado para a página principal da aplicação."
            ],
            "video": "https://www.youtube.com/shorts/u7smVWH7lnE"
        },
        {
            "title": "- Como é que atualizo os meus dados pessoais?",
            "description": [
                "1️⃣: Navegue até ao menu inicial da aplicação. De seguida, clique no botão 'Definições'.",
                "2️⃣: Clique no botão 'Editar' e irá verificar que os campos passaram a ser editáveis, o fundo dos mesmos passa a ser azul, e a opção 'Guardar' ficou disponível.",
                "3️⃣: Após alterar as informações que pretende, clique no botão 'Guardar'.",
                "4️⃣: Para finalizar, irá aparecer um pop-up onde poderá confirmar que as ações podem ser efetuadas.",
                "5️⃣: Os seus dados pessoais foram atualizados com sucesso."
            ],
            "video": "https://www.youtube.com/shorts/74L_aR3VRPQ"
        },
        {
            "title": "- Como é que me vinculo ao meu cuidador?",
            "description": [
                "1️⃣: Navegue até ao menu inicial da aplicação. De seguida, clique no botão 'Cuidadores'.",
                "2️⃣: Clique num botão verde que se encontra disponível e visualize o popup a aparecer.",
                "3️⃣: Insira o email do seu cuidador, e clique no botão 'Vincular'.",
                "4️⃣: O pedido foi enviado com sucesso, e o seu cuidador foi informado. Agora só tem de aguardar pela aceitação do seu cuidador."
            ],
            "video": "https://www.youtube.com/shorts/CQ-z3IHaISE"
        },
        {
            "title": "- Como é que adiciono uma credencial?",
            "description": [
                "1️⃣: Navegue até ao menu inicial da aplicação. De seguida, clique no botão 'Credenciais'.",
                "2️⃣: Clique no botão 'Adicionar Credencial' e vai lhe aparecer um formulário com os dados a inserir relativamente à credencial.",
                "3️⃣: Pode selecionar se pretende adicionar dados relativamente a uma credencial de login, ou a uma credencial de cartão.",
                "4️⃣: Após preencher os campos, clique no botão 'Adicionar'.",
                "5️⃣: A sua credencial foi adicionada com sucesso."
            ],
            "video": "https://www.youtube.com/shorts/d3BAy8dy860"
        }
    ]
}